package JavaRushLevel22;

public class FormattedTest {
    public static void main(String[] args) {
        System.out.printf("%,d%n", 1000000 );
                                                //варавнивание строки по левому краю недостающие символы до 4х будут заполнены пробелами
                                                // выравнивание числа по левому краю всего под число будут выделены 8 элементов, недостающие
                                    //сиволы будут заполнены пробелами в право, причем после запятой будут строго 4 числа(если после точки будет так
        //                          .46431-а нам нужно 4 числа-то округление будет 4643
        String s = String.format("Курс валют: %-4s%-8.4f  %-4s%-8.4f","USD", 158.46431, "EUR", 63.3695);
        System.out.println(s);
//форматирование таблицы
        System.out.printf("%-5s%-11s%-25s%-11s%n","Код","За единиц","Валюты","Рублей РФ");
        System.out.println("-----------------------------------------------------");
        System.out.printf("%-5s%-11d%-25s%-11.4f%n","AUD",1,"Австралийский доллар",44.9883);
        System.out.printf("%-5s%-11d%-25s%-11.4f%n","GBP",1,"Фунт стерлингов",86.8429);
        System.out.printf("%-5s%-11d%-25s%-11.4f%n","BYR",10000,"Белорусский рубль",39.7716);
        System.out.printf("%-5s%-11d%-25s%-11.4f%n","DKK",10,"Датская крона",84.9192);
        System.out.printf("%-5s%-11d%-25s%-11.4f%n","USD",1,"Доллар США",58.4643);
        System.out.printf("%-5s%-11d%-25s%-11.4f%n","EUR",1,"Евро",63.3695);
        System.out.printf("%-5s%-11d%-25s%-11.4f%n","KZT",100,"Казахский тенге",31.4654);
    }
}
