package TinkiffTasks;
/*Вам даны два натуральных числа ﻿NN﻿ и ﻿MM﻿.

Найдите количество последовательностей целых чисел ﻿AA﻿ длины ﻿N,N,﻿ таких что:


﻿0 \leqslant A_i (i=1,2,3,...,N)0⩽A
i
​
 (i=1,2,3,...,N)﻿
﻿\sum_{i=1}^N A_i=M∑
i=1
N
​
 A
i
​
 =M﻿
﻿A_1 \oplus A_2 \oplus... A_N=0A
1
​
 ⊕A
2
​
 ⊕...A
N
​
 =0﻿ ﻿(\oplus(⊕﻿ обозначает хог - исключающее или﻿))﻿

Так как ответ может быть большим, выведите его по модулю 998244353.


Формат входных данных

В первой строке вводятся два числа ﻿NN﻿ и ﻿M(1 \leqslant N, M \leqslant 5000).M(1⩽N,M⩽5000).﻿


Формат выходных данных

Выведите одно число ﻿-−﻿ количество таких последовательностей ﻿AA﻿ по модулю 998244353.

Примеры данных
Пример 1
2 2
1
Пример 2
5 4
15
Пример 3
5 20
475
Решение*/
public class Task5_1 {
}
